## Import Library & Dataset

**Import Library**

In [1]:
import pandas as pd
import datetime as dt
import seaborn as sns 
import numpy as np
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

**Import Dataset**

In [2]:
transactions = pd.read_csv('EVN/trx_2019_2020.csv')
user = pd.read_csv('EVN/user_2019_2020.csv')
event = pd.read_csv('EVN/event_2019_2020.csv')

1. Sneak peek at **Dataframe transactions**

In [3]:
transactions.head()

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type
0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer

In [4]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69170 entries, 0 to 69169
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            69170 non-null  object
 1   event_id           69170 non-null  object
 2   trx_date           69170 non-null  object
 3   price              69170 non-null  int64
 4   total_ticket_sold  69170 non-null  int64
 5   event_type         69170 non-null  object
 6   event_category     69170 non-null  object
 7   organization_type  69170 non-null  object
dtypes: int64(2), object(6)
memory usage: 4.2+ MB

2. Sneak peek at **Dataframe user**

In [5]:
user.head()

,user_id,gender,age_when_register,join_date,location,device_name,user_type,interests
0,000140bd498ce1c9eeae046aa37b205cc65d2595ed526a...,none,NaN,2019-07-26,NaN,NaN,Guest,NaN
1,0003b84440334ffdddcf8b3ffa9d7696a5675f451b69b8...,NaN,NaN,2020-05-20,NaN,NaN,Guest,NaN
2,00092ca94bb736eb3e89a9dd815d3f68d27a3aca6faece...,none,NaN,2020-06-08,NaN,NaN,Guest,NaN
3,0009bb2348a3a05d6b7dcc54394ff580c10440319f3878...,none,NaN,2019-08-30,NaN,NaN,Guest,NaN
4,000b0d458a510a0cb1f6124f88fe45ef4f2a97ad8716ba...,none,NaN,2020-02-17,NaN,NaN,Guest,NaN

In [6]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36763 entries, 0 to 36762
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            36763 non-null  object
 1   gender             35664 non-null  object
 2   age_when_register  11124 non-null  float64
 3   join_date          36763 non-null  object
 4   location           8127 non-null   object
 5   device_name        8543 non-null   object
 6   user_type          36763 non-null  object
 7   interests          7912 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.2+ MB

2. Sneak peek at **Dataframe transactions**

In [7]:
transactions.head()

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type
0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer
4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer

In [8]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69170 entries, 0 to 69169
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            69170 non-null  object
 1   event_id           69170 non-null  object
 2   trx_date           69170 non-null  object
 3   price              69170 non-null  int64
 4   total_ticket_sold  69170 non-null  int64
 5   event_type         69170 non-null  object
 6   event_category     69170 non-null  object
 7   organization_type  69170 non-null  object
dtypes: int64(2), object(6)
memory usage: 4.2+ MB

3. Sneak peek at **Dataframe Event**

In [9]:
event.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2940 entries, 0 to 2939
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   event_id        2940 non-null   object
 1   event_category  2912 non-null   object
 2   location        2940 non-null   object
dtypes: object(3)
memory usage: 69.0+ KB

## Data Cleaning

### 1. Handling Missing Values

**1. Dataframe `transactions`**

Because RFM analysis relies on transactions behavior, so our transactions data become the most imprtant data in this analysis.

In [10]:
missing_data_transactions = transactions.isnull().sum(axis=0).reset_index()

# mengubah nama kolom
missing_data_transactions.columns = ['variable','missing values']

# menambah kolom percantege missing (fillong factor)
missing_data_transactions['missing values (%)'] = (missing_data_transactions['missing values']) / (transactions.shape[0]) *100

# sortir filling factor dari terkecil yang terendah
missing_data_transactions.sort_values('missing values (%)').reset_index(drop = True)

            variable  missing values  missing values (%)
0            user_id               0                 0.0
1           event_id               0                 0.0
2           trx_date               0                 0.0
3              price               0                 0.0
4  total_ticket_sold               0                 0.0
5         event_type               0                 0.0
6     event_category               0                 0.0
7  organization_type               0                 0.0

Good, there is no missing column in this dataframe

**2. Dataframe `user`**

In [11]:
missing_data_user = user.isnull().sum(axis=0).reset_index()

# mengubah nama kolom
missing_data_user.columns = ['variable','missing values']

# menambah kolom percantege missing (fillong factor)
missing_data_user['missing values (%)'] = (missing_data_user['missing values']) / (user.shape[0]) *100

# sortir filling factor dari terkecil yang terendah
missing_data_user.sort_values('missing values (%)').reset_index(drop = True)

            variable  missing values  missing values (%)
0            user_id               0            0.000000
1          join_date               0            0.000000
2          user_type               0            0.000000
3             gender            1099            2.989419
4  age_when_register           25639           69.741316
5        device_name           28220           76.761962
6           location           28636           77.893534
7          interests           28851           78.478361

For missing value more than 50%, we will drop it, since we will not use it for RFM analysis. But for missing value gender,since the percentage of missing values is around 2,9%, we will not drop it. We can use it as feature to enriches our analysis later on data exploration section. We will use mode to fill the missing value

In [12]:
# drop missing value
user.drop(['age_when_register', 'device_name', 'location', 'interests'], axis=1, inplace=True)

In [13]:
# checking gender mode
user['gender'].mode()

0    none
dtype: object

So why we get none as mode value from gender? The answer is should between male and female. So we should re check the value in the gender column

In [14]:
user['gender'].unique()

array(['none', nan, 'female', 'male'], dtype=object)

It turns out we found that gender column contain none as value, so first we should replace this with nan

In [15]:
user['gender'].replace('none', np.nan, inplace=True)

In [16]:
missing_data_user = user.isnull().sum(axis=0).reset_index()

# mengubah nama kolom
missing_data_user.columns = ['variable','missing values']

# menambah kolom percantege missing (fillong factor)
missing_data_user['missing values (%)'] = (missing_data_user['missing values']) / (user.shape[0]) *100

# sortir filling factor dari terkecil yang terendah
missing_data_user.sort_values('missing values (%)').reset_index(drop = True)

    variable  missing values  missing values (%)
0    user_id               0            0.000000
1  join_date               0            0.000000
2  user_type               0            0.000000
3     gender           22671           61.667981

So, because gender column also have missing column more than 50%, we decide to also drop it. It will not affecr our analysis, but only make our data exploration less rich

In [17]:
# drop missing value
user.drop('gender', axis=1, inplace=True)

In [18]:
user.head()

                                             user_id   join_date user_type
0  000140bd498ce1c9eeae046aa37b205cc65d2595ed526a...  2019-07-26     Guest
1  0003b84440334ffdddcf8b3ffa9d7696a5675f451b69b8...  2020-05-20     Guest
2  00092ca94bb736eb3e89a9dd815d3f68d27a3aca6faece...  2020-06-08     Guest
3  0009bb2348a3a05d6b7dcc54394ff580c10440319f3878...  2019-08-30     Guest
4  000b0d458a510a0cb1f6124f88fe45ef4f2a97ad8716ba...  2020-02-17     Guest

We'll only get complete information in `join_date` and `user_type`. But that's okay

**Dataframe `event`**

In [19]:
missing_data_event = event.isnull().sum(axis=0).reset_index()

# mengubah nama kolom
missing_data_event.columns = ['variable','missing values']

# menambah kolom percantege missing (fillong factor)
missing_data_event['missing values (%)'] = (missing_data_event['missing values']) / (event.shape[0]) *100

# sortir filling factor dari terkecil yang terendah
missing_data_event.sort_values('missing values (%)').reset_index(drop = True)

         variable  missing values  missing values (%)
0        event_id               0            0.000000
1        location               0            0.000000
2  event_category              28            0.952381

Since we already have non missing **event_category** column in `transactions` dataframe, so we drop this column

In [20]:
event.drop('event_category', axis=1, inplace=True)

In [21]:
event.head()

                                            event_id   location
0  93eca343c3bc2f6e85fc1a812ee527dcc39bec3db46142...    Jakarta
1  86c3939a538a3bdbd31d7fdf540b911a74b5c236188f3f...    Jakarta
2  4825dfcb9ed3d8e9cb936ed1e74d773224dd84e0a09e61...  Indonesia
3  b71e0d94eab24ab4a3bfcd766aa0dd2cdac6be0fd4db06...    Jakarta
4  f1b24c2cc82dc13d1817ae36db8e25ac40bc581bf6ef3b...       Bali

### Merge Dataframe

Firs, we merge transactions with user

In [22]:
trx_user = pd.merge(transactions, user, on='user_id', how='left')

In [23]:
trx_user.head()

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,user_type
0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Registered
1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Guest
2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered
3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered
4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-31,Guest

And then, merge the trx_user with event

In [24]:
trx_user_event = pd.merge(trx_user, event, on='event_id', how='left')

In [25]:
trx_user_event.head()

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,user_type,location
0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Registered,Jakarta
1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Guest,Jakarta
2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered,Jakarta
3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered,Jakarta
4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-31,Guest,Jakarta

### Detecting missing values in trx_user_event

In [26]:
missing_data = trx_user_event.isnull().sum(axis=0).reset_index()

# mengubah nama kolom
missing_data.columns = ['variable','missing values']

# menambah kolom percantege missing (fillong factor)
missing_data['missing values (%)'] = (missing_data['missing values']) / (trx_user_event.shape[0]) *100

# sortir filling factor dari terkecil yang terendah
missing_data.sort_values('missing values (%)').reset_index(drop = True)

             variable  missing values  missing values (%)
0             user_id               0            0.000000
1            event_id               0            0.000000
2            trx_date               0            0.000000
3               price               0            0.000000
4   total_ticket_sold               0            0.000000
5          event_type               0            0.000000
6      event_category               0            0.000000
7   organization_type               0            0.000000
8           join_date              53            0.076623
9           user_type              53            0.076623
10           location           15144           21.893885

Since join_date and user_type has no significant missing value, so we'll delete the row that contain this missing value

In [27]:
trx_user_event.dropna(subset=['join_date', 'user_type'], inplace=True)

In [28]:
missing_data = trx_user_event.isnull().sum(axis=0).reset_index()

# mengubah nama kolom
missing_data.columns = ['variable','missing values']

# menambah kolom percantege missing (fillong factor)
missing_data['missing values (%)'] = (missing_data['missing values']) / (trx_user_event.shape[0]) *100

# sortir filling factor dari terkecil yang terendah
missing_data.sort_values('missing values (%)').reset_index(drop = True)

             variable  missing values  missing values (%)
0             user_id               0            0.000000
1            event_id               0            0.000000
2            trx_date               0            0.000000
3               price               0            0.000000
4   total_ticket_sold               0            0.000000
5          event_type               0            0.000000
6      event_category               0            0.000000
7   organization_type               0            0.000000
8           join_date               0            0.000000
9           user_type               0            0.000000
10           location           15144           21.910673

Now we'll look at location columns. First we slice and take only the missing row in location columns

In [29]:
trx_user_event.shape

(69117, 11)

In [30]:
loc_na = trx_user_event[trx_user_event['location'].isna()]

In [31]:
loc_na.shape

(15144, 11)

And look is there any relationship between locations and other features. In this case, I suggest that there is a relationship between location, event_type, event_category

In [32]:
for col in loc_na.columns: 
    print(col + ":", loc_na[col].nunique())

user_id: 5042
event_id: 5291
trx_date: 14949
price: 43
total_ticket_sold: 8
event_type: 2
event_category: 3
organization_type: 3
join_date: 757
user_type: 2
location: 0

In [33]:
loc_na['event_type'].unique()

array(['Movie', 'Event'], dtype=object)

In [34]:
loc_na['event_category'].nunique()

3

**Imputation with mode**

**event_category == Concert, Music, Festival**

In [35]:
trx_user_event[trx_user_event['event_category'] == 'Concert, Music, Festival']['location'].mode()

0    Bali
dtype: object

In [36]:
trx_user_event[trx_user_event['event_category'] == 'Concert, Music, Festival']['location']

11609    Bali
12474    Bali
12539    Bali
14727    Bali
16673    Bali
48901     NaN
Name: location, dtype: object

In [37]:
trx_user_event.loc[48901,'location'] = 'Bali'

**event_category == Workshop**

In [38]:
trx_user_event[trx_user_event['event_category'] == 'Workshop']['location'].mode()

0    Makassar
dtype: object

In [39]:
trx_user_event[(trx_user_event['event_category'] == 'Workshop') & (trx_user_event['location'].isna())]

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,user_type,location
49156,d706ae4c83455692d099e6255583f51bcaee466c01b602...,a51ab54c9c7394a052dc73b3adc164af628dcb1049e759...,2020-02-17 09:41:04,0,1,Event,Workshop,Event Organizer,2019-03-04,Registered,NaN
51472,5a5bad93c516903217429296f41e7c72b270159da54da5...,a51ab54c9c7394a052dc73b3adc164af628dcb1049e759...,2020-04-17 03:09:18,0,5,Event,Workshop,Event Organizer,2018-01-09,Registered,NaN
51473,7c6a0a99b02e47badc12b2f4ac52db93a5d8c789986912...,a51ab54c9c7394a052dc73b3adc164af628dcb1049e759...,2020-04-17 03:09:18,0,3,Event,Workshop,Event Organizer,2019-01-16,Guest,NaN
51474,1b710ade9432a036d79a44bf79368326b21919b6973616...,a51ab54c9c7394a052dc73b3adc164af628dcb1049e759...,2020-04-17 03:09:18,0,2,Event,Workshop,Event Organizer,2019-08-14,Guest,NaN
51475,917378748f44c1b205af7a0eaa97c8e049857931c25b2e...,a51ab54c9c7394a052dc73b3adc164af628dcb1049e759...,2020-04-17 03:09:19,0,3,Event,Workshop,Event Organizer,2018-12-10,Registered,NaN

In [40]:
list_workshop = [49156,51472,51473,51474,51475]

In [41]:
trx_user_event.loc[list_workshop, 'location'] = 'Makassar'

**event_category == Movies or Cinemas**

In [42]:
trx_user_event[trx_user_event['event_category'] == 'Movies or Cinemas']['location'].notna().any()

False

In turns all of value in locations for movies and cinemas category is missing. So, we'll impute with new locations, called cinemas

In [43]:
trx_user_event.isnull().sum()

user_id                  0
event_id                 0
trx_date                 0
price                    0
total_ticket_sold        0
event_type               0
event_category           0
organization_type        0
join_date                0
user_type                0
location             15138
dtype: int64

In [44]:
trx_user_event.fillna('Cinemas', inplace=True)

In [45]:
trx_user_event.isnull().sum()

user_id              0
event_id             0
trx_date             0
price                0
total_ticket_sold    0
event_type           0
event_category       0
organization_type    0
join_date            0
user_type            0
location             0
dtype: int64

In [46]:
trx_user_event.shape

(69117, 11)

### 2. Convert Date type into datetime

In [47]:
trx_user_event.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69117 entries, 0 to 69164
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            69117 non-null  object
 1   event_id           69117 non-null  object
 2   trx_date           69117 non-null  object
 3   price              69117 non-null  int64
 4   total_ticket_sold  69117 non-null  int64
 5   event_type         69117 non-null  object
 6   event_category     69117 non-null  object
 7   organization_type  69117 non-null  object
 8   join_date          69117 non-null  object
 9   user_type          69117 non-null  object
 10  location           69117 non-null  object
dtypes: int64(2), object(9)
memory usage: 8.8+ MB

In [48]:
list_date = ['trx_date', 'join_date']
for date in list_date:
    trx_user_event[date] = pd.to_datetime(trx_user_event[date])

In [49]:
# Adding Years, Months, Days, Hours, and Date
trx_user_event['years'] = trx_user_event['trx_date'].dt.year
trx_user_event['month_year'] = trx_user_event['trx_date'].dt.to_period('M')
trx_user_event['days'] = trx_user_event['trx_date'].dt.dayofweek+1
trx_user_event['hours'] = trx_user_event['trx_date'].dt.hour + 7
trx_user_event['date'] = trx_user_event['trx_date'].dt.date
trx_user_event['dayofmonth'] = trx_user_event['trx_date'].dt.day

trx_user_event.head()

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,user_type,location,years,month_year,days,hours,date,dayofmonth
0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Registered,Jakarta,2019,2019-01,2,9,2019-01-01,1
1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Guest,Jakarta,2019,2019-01,2,10,2019-01-01,1
2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered,Jakarta,2019,2019-01,2,10,2019-01-01,1
3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered,Jakarta,2019,2019-01,2,10,2019-01-01,1
4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-31,Guest,Jakarta,2019,2019-01,2,10,2019-01-01,1

### 3. Adding Neccesary Features

#### In order to perform RFM analysis, we should know total amount for every transactions purchase, so we can know the monetaryvalue for each customer

In [50]:
trx_user_event['total_price'] = trx_user_event['total_ticket_sold'] * trx_user_event['price']

In [51]:
trx_user_event.head()

,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,user_type,location,years,month_year,days,hours,date,dayofmonth,total_price
0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Registered,Jakarta,2019,2019-01,2,9,2019-01-01,1,225000
1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,Guest,Jakarta,2019,2019-01,2,10,2019-01-01,1,150000
2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered,Jakarta,2019,2019-01,2,10,2019-01-01,1,100000
3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,Registered,Jakarta,2019,2019-01,2,10,2019-01-01,1,100000
4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-31,Guest,Jakarta,2019,2019-01,2,10,2019-01-01,1,75000

#### We need to minimize the event_category, since event_category have a lot of unique values

In [52]:
trx_user_event['event_category'].nunique()

297

So, first step that we took is to take every first word in event_category and store it in new column called word_event

In [53]:
trx_user_event['word_event'] = trx_user_event['event_category'].apply(lambda x: x.split(',')[0])

In [54]:
trx_user_event['word_event']

0        Art Exhibition
1        Art Exhibition
2        Art Exhibition
3        Art Exhibition
4        Art Exhibition
              ...
69152           Webinar
69153           Webinar
69155           Webinar
69162           Webinar
69164           Webinar
Name: word_event, Length: 69117, dtype: object

In [55]:
trx_user_event['word_event'].unique()

array(['Art Exhibition', 'Wedding Expo', 'Movies or Cinemas', 'Seminar',
       'University Student', 'Music', 'Workshop', 'Charity', 'Festival',
       'Talkshow', 'Running', 'Beauty', 'Theme Park', 'Game',
       'Cooking Class', 'Group Activities', 'Competition', 'Tech Startup',
       'Sport', 'Business', 'Training', 'Nightlife', 'Exibition',
       'Travel', 'Performance', 'Concert', 'Exhibition', 'Conference',
       'Open Trip', 'Movie Screening', 'Bazaar', 'Movies', 'Networking',
       'Water Park', 'Education', 'Culture', 'Art', 'Webinar',
       'Online Event'], dtype=object)

then we group each word_event into specific groups
- *Events* : (Wedding Expo, Seminar, University Student, Workshop, Charity, Talkshow, Group Activities, Competition, Tech Startup, Business, Training, Conference, Networking, Education, Webinar, Online Event)
- *Movies* : (Movies or Cinemas, 'Movie Screening, Movies)
- *Attractions* : (Art Exhibition, Music, Festival, Beauty, Theme Park, Game, Cooking Class, Sport, Nightlife, Exibition, Travel, Performance, Concert, Exhibition, Open Trip, Bazaar, Water Park, Culture, Art )
- *Others* not in this three

In [56]:
list_event = ['Wedding Expo','Seminar', 'University Student', 'Workshop', 'Charity', 'Talkshow', 'Group Activities', 'Competition',
             'Tech Startup', 'Business', 'Training', 'Conference', 'Networking', 'Education', 'Webinar', 'Online Event']
list_movies = ['Movies or Cinemas', 'Movie Screening', 'Movies']
list_attr = ['Art Exhibition', 'Music', 'Festival', 'Running', 'Beauty', 'Theme Park', 'Game', 'Cooking Class', 'Sport', 'Nightlife',
            'Exibition', 'Travel', 'Performance', 'Concert', 'Exhibition',  'Open Trip', 'Bazaar', 'Water Park', 'Culture', 'Art']

In [57]:
def categories(x):
    if x in list_event:
        return 'events'
    elif x in list_movies:
        return 'movies'
    elif x in list_attr:
        return 'attractions'
    else:
        return 'others'

In [58]:
trx_user_event['sub_category'] = trx_user_event['word_event'].apply(categories)

In [59]:
trx_user_event['sub_category'].unique()

array(['attractions', 'events', 'movies'], dtype=object)

**add index as trx_number/invoice number**


since there is no inovoice number, we'll make index+1 as invoice number

In [60]:
trx_user_event.reset_index(inplace=True)
trx_user_event['invoice_number'] = trx_user_event.index + 1

In [61]:
trx_user_event

,index,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,...,years,month_year,days,hours,date,dayofmonth,total_price,word_event,sub_category,invoice_number
0,0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,...,2019,2019-01,2,9,2019-01-01,1,225000,Art Exhibition,attractions,1
1,1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,...,2019,2019-01,2,10,2019-01-01,1,150000,Art Exhibition,attractions,2
2,2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,...,2019,2019-01,2,10,2019-01-01,1,100000,Art Exhibition,attractions,3
3,3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,...,2019,2019-01,2,10,2019-01-01,1,100000,Art Exhibition,attractions,4
4,4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-31,...,2019,2019-01,2,10,2019-01-01,1,75000,Art Exhibition,attractions,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
69112,69152,04da1562993d0ff6159bb1a931f8067dc6fb78a0e645d4...,215cc964404a1c632341a439e448bd5f1fd4db8ef781bf...,2020-06-30 09:10:57,0,1,Event,Webinar,Event Organizer and Promotor,2020-04-28,...,2020,2020-06,2,16,2020-06-30,30,0,Webinar,events,69113
69113,69153,642179b1b34eafbc527f59c8e62d2d51abbcce0912855e...,d161f9f74fa109cc6642db193903181cc6031357e71999...,2020-06-30 09:12:45,0,1,Event,Webinar,Event Organizer and Promotor,2020-05-09,...,2020,2020-06,2,16,2020-06-30,30,0,Webinar,events,69114
69114,69155,caf35894b6517f2841bdad1c5c3371a413ece7ca8400a0...,215cc964404a1c632341a439e448bd5f1fd4db8ef781bf...,2020-06-30 09:28:12,0,1,Event,Webinar,Event Organizer and Promotor,2020-02-17,...,2020,2020-06,2,16,2020-06-30,30,0,Webinar,events,69115
69115,69162,612dda1ab2f25e7a79b73c80ced425a6740b9ba9fa9649...,98a5e21b6cdcaa5e7d83bdb710b437afdb98904c79a899...,2020-06-30 13:06:25,0,1,Event,"Webinar, Game",Event Organizer and Promotor,2020-05-21,...,2020,2020-06,2,20,2020-06-30,30,0,Webinar,events,69116
69116,69164,a0cf46fcdaf55baee74c1886d53f57afa09e0317a71370...,d4b603a84efd816b8b12f42882a3cb7f79dd11b62ea919...,2020-06-30 14:43:26,0,1,Event,"Webinar, Education, Networking, Seminar",Event Organizer and Promotor,2020-06-27,...,2020,2020-06,2,21,2020-06-30,30,0,Webinar,events,69117

### 4. Removing Unneccesary Features

In [62]:
trx_user_event.head()

,index,user_id,event_id,trx_date,price,total_ticket_sold,event_type,event_category,organization_type,join_date,...,years,month_year,days,hours,date,dayofmonth,total_price,word_event,sub_category,invoice_number
0,0,d3bf14fe0bffbb499ef0d341f4b7c12aad9fbd3b9e0fd6...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 02:15:30,75000,3,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,...,2019,2019-01,2,9,2019-01-01,1,225000,Art Exhibition,attractions,1
1,1,4f3e46a6e94452b566553485b619d2f305bd9d875d4f6d...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:04:32,75000,2,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2019-01-01,...,2019,2019-01,2,10,2019-01-01,1,150000,Art Exhibition,attractions,2
2,2,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:44,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,...,2019,2019-01,2,10,2019-01-01,1,100000,Art Exhibition,attractions,3
3,3,23c44b20dafb34672868945ce6428ead219eb8bb5312c5...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:11:50,100000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-08,...,2019,2019-01,2,10,2019-01-01,1,100000,Art Exhibition,attractions,4
4,4,38b796a79de6f453bb1ccc704e8aa86dd21f186398614e...,6629d5a73302852ef915dbda22fa1994213eb36e41c893...,2019-01-01 03:15:19,75000,1,Event,"Art Exhibition, Family, Art, Exhibition, Group...",Event Organizer,2018-12-31,...,2019,2019-01,2,10,2019-01-01,1,75000,Art Exhibition,attractions,5

Here i'll drop several column such as event_category, event_type, organization_type, and join_date

In [63]:
trx_user_event.drop(columns=['index','event_category','event_type', 'organization_type', 'join_date'], inplace=True)

In [64]:
trx_user_event.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69117 entries, 0 to 69116
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            69117 non-null  object
 1   event_id           69117 non-null  object
 2   trx_date           69117 non-null  datetime64[ns]
 3   price              69117 non-null  int64
 4   total_ticket_sold  69117 non-null  int64
 5   user_type          69117 non-null  object
 6   location           69117 non-null  object
 7   years              69117 non-null  int64
 8   month_year         69117 non-null  period[M]
 9   days               69117 non-null  int64
 10  hours              69117 non-null  int64
 11  date               69117 non-null  object
 12  dayofmonth         69117 non-null  int64
 13  total_price        69117 non-null  int64
 14  word_event         69117 non-null  object
 15  sub_category       69117 non-null  object
 16  invoice_number     69117 non-null  int64
dtypes: datetime64[ns](1), int64(8), object(7), period[M](1)
memory usage: 9.0+ MB

In [65]:
trx_user_event['invoice_number'] = trx_user_event['invoice_number'].astype('str')

In [67]:
trx_user_event.to_csv('EVN/clean_df.csv',index=False)